const Questions = [
    {
        question: "Первый этап построения алгоритмов",
        answerIndex: 2,
        answers: [
            {
                content: "разработка модели",
                answer: false,
            },
            {
                content: "написание программного кода",
                answer: false,
            },
            {
                content: "постановка задач",
                answer: false,
            },
            {
                content: "тестирование программы",
                answer: false,
            }
        ]
    },
    {
        question: "Алгоритм – это",
        answerIndex: 2,
        answers: [
            {
                content: "правила выполнения определенных действий",
                answer: false,
            },
            {
                content: "ориентированный граф, указывающий порядок выполнения некоторого набора команд",
                answer: false,
            },
            {
                content: "описание последовательности действий, строгое исполнение которых приводит к решению поставленной задачи за конечное число шагов",
                answer: false,
            },
            {
                content: "набор команд для компьютера",
                answer: false,
            }
        ]
    },
    {
        question: "Алгоритм называется линейным, если",
        answerIndex: 2,
        answers: [
            {
                content: "он составлен так, что его выполнение предполагает многократное повторение одних и тех же действий",
                answer: false,
            },
            {
                content: "ход его выполнения зависит от истинности тех или иных условий",
                answer: false,
            },
            {
                content: "его команды выполняются в порядке их естественного следования друг за другом независимо от каких-либо условий",
                answer: false,
            },
            {
                content: "он представим в табличной форме",
                answer: false,
            }
        ]
    },
    {
        question: "Алгоритм называется циклическим, если",
        answerIndex: 0,
        answers: [
            {
                content: "он составлен так, что его выполнение предполагает многократное повторение одних и тех же действий",
                answer: false,
            },
            {
                content: "ход его выполнения зависит от истинности тех или иных условий",
                answer: false,
            },
            {
                content: "его команды выполняются в порядке их естественного следования друг за другом независимо от каких-либо условий",
                answer: false,
            },
            {
                content: "он представим в табличной форме",
                answer: false,
            }
        ]
    }
]

export default Questions